dataMentah(csv)->list->array->series->dataframe<br>
<h3>Pandas</h3>

In [17]:
import numpy as np
import pandas as pd

In [18]:
listnama=['abi','biba','babu']
arrlistnama=np.array(listnama)
listumur=[100,87,73]
arrlistumur=np.array(listumur)
dictkel={'abi':100,'biba':87,'babu':73}

In [40]:
iniSeries=pd.Series(listumur,listnama)
iniSeries

abi     100
biba     87
babu     73
dtype: int64

In [32]:
iniSeries['babu']

73

In [36]:
iniDf = pd.DataFrame(iniSeries, columns=['Umur'])
iniDf

      Umur
abi    100
biba    87
babu    73

In [56]:
iniDf['Berat Badan']=[78,56,120]
iniDf['Tinggi Badan']=[188, 181,154]
iniDf['Gender']=['Laki-laki', 'Perempuan', 'Laki-laki']

In [44]:
iniDf

      Umur  Berat Badan  Tinggi Badan     Gender
abi    100           78           188  Laki-laki
biba    87           56           181  Perempuan
babu    73          120           154      Waria

In [47]:
iniDf[iniDf['Berat Badan']<100]

      Umur  Berat Badan  Tinggi Badan     Gender
abi    100           78           188  Laki-laki
biba    87           56           181  Perempuan

In [49]:
iniDf[['Gender','Umur']]

         Gender  Umur
abi   Laki-laki   100
biba  Perempuan    87
babu      Waria    73

In [57]:
iniDf.loc[['babu'],['Gender']]

         Gender
babu  Laki-laki

In [58]:
iniDf[iniDf['Gender']=='Laki-laki']

      Umur  Berat Badan  Tinggi Badan     Gender
abi    100           78           188  Laki-laki
babu    73          120           154  Laki-laki

In [59]:
iniDf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, abi to babu
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Umur          3 non-null      int64
 1   Berat Badan   3 non-null      int64
 2   Tinggi Badan  3 non-null      int64
 3   Gender        3 non-null      object
dtypes: int64(3), object(1)
memory usage: 200.0+ bytes

In [60]:
iniDf.describe()

             Umur  Berat Badan  Tinggi Badan
count    3.000000     3.000000      3.000000
mean    86.666667    84.666667    174.333333
std     13.503086    32.516662     17.953644
min     73.000000    56.000000    154.000000
25%     80.000000    67.000000    167.500000
50%     87.000000    78.000000    181.000000
75%     93.500000    99.000000    184.500000
max    100.000000   120.000000    188.000000